[Killed] EqualityOperator
src/services/CircularLogicDetector.ts:9:75
 export class CircularLogicDetector {
   async detect(text: string): Promise<Issue[]> {
     const issues: Issue[] = [];
-    const sentences = text.split(/[.!?]+/).map(s => s.trim()).filter(s => s.length > 0);
+    const sentences = text.split(/[.!?]+/).map(s => s.trim()).filter(s => s.length <= 0);
 
     if (sentences.length < 2) return issues;
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ArrowFunction
src/services/CircularLogicDetector.ts:9:70
 export class CircularLogicDetector {
   async detect(text: string): Promise<Issue[]> {
     const issues: Issue[] = [];
-    const sentences = text.split(/[.!?]+/).map(s => s.trim()).filter(s => s.length > 0);
+    const sentences = text.split(/[.!?]+/).map(s => s.trim()).filter(() => undefined);
 
     if (sentences.length < 2) return issues;
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] EqualityOperator
src/services/CircularLogicDetector.ts:11:9
     const issues: Issue[] = [];
     const sentences = text.split(/[.!?]+/).map(s => s.trim()).filter(s => s.length > 0);
 
-    if (sentences.length < 2) return issues;
+    if (sentences.length >= 2) return issues;
 
     // Check for repeated phrases / n-gram overlap
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] EqualityOperator
src/services/CircularLogicDetector.ts:11:9
     const issues: Issue[] = [];
     const sentences = text.split(/[.!?]+/).map(s => s.trim()).filter(s => s.length > 0);
 
-    if (sentences.length < 2) return issues;
+    if (sentences.length <= 2) return issues;
 
     // Check for repeated phrases / n-gram overlap
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] EqualityOperator
src/services/CircularLogicDetector.ts:14:21
     if (sentences.length < 2) return issues;
 
     // Check for repeated phrases / n-gram overlap
-    for (let i = 0; i < sentences.length; i++) {
+    for (let i = 0; i >= sentences.length; i++) {
       for (let j = i + 1; j < sentences.length; j++) {
         const overlap = this.computeOverlap(sentences[i], sentences[j]);
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] BlockStatement
src/services/CircularLogicDetector.ts:14:48
     if (sentences.length < 2) return issues;
 
     // Check for repeated phrases / n-gram overlap
-    for (let i = 0; i < sentences.length; i++) {
-      for (let j = i + 1; j < sentences.length; j++) {
-        const overlap = this.computeOverlap(sentences[i], sentences[j]);
-        if (overlap > 0.6) {
-          const start = text.indexOf(sentences[j]);
-          issues.push({
-            type: 'circular_logic',
-            position: { start, end: start + sentences[j].length },
-            lineNumber: this.getLineNumber(text, start),
-            flaggedText: sentences[j].substring(0, 80),
-            explanation: `This argument repeats a point made earlier in the draft (see sentence ${i + 1}).`,
-            severity: 'medium',
-            confidence: Math.min(0.95, overlap),
-          });
-        }
-      }
-    }
+    for (let i = 0; i < sentences.length; i++) {}
 
     // Check for self-referential patterns
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ArithmeticOperator
src/services/CircularLogicDetector.ts:15:20
 
     // Check for repeated phrases / n-gram overlap
     for (let i = 0; i < sentences.length; i++) {
-      for (let j = i + 1; j < sentences.length; j++) {
+      for (let j = i - 1; j < sentences.length; j++) {
         const overlap = this.computeOverlap(sentences[i], sentences[j]);
         if (overlap > 0.6) {
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
src/services/CircularLogicDetector.ts:15:54
 
     // Check for repeated phrases / n-gram overlap
     for (let i = 0; i < sentences.length; i++) {
-      for (let j = i + 1; j < sentences.length; j++) {
-        const overlap = this.computeOverlap(sentences[i], sentences[j]);
-        if (overlap > 0.6) {
-          const start = text.indexOf(sentences[j]);
-          issues.push({
-            type: 'circular_logic',
-            position: { start, end: start + sentences[j].length },
-            lineNumber: this.getLineNumber(text, start),
-            flaggedText: sentences[j].substring(0, 80),
-            explanation: `This argument repeats a point made earlier in the draft (see sentence ${i + 1}).`,
-            severity: 'medium',
-            confidence: Math.min(0.95, overlap),
-          });
-        }
-      }
+      for (let j = i + 1; j < sentences.length; j++) {}
     }
 
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ConditionalExpression
src/services/CircularLogicDetector.ts:17:13
     for (let i = 0; i < sentences.length; i++) {
       for (let j = i + 1; j < sentences.length; j++) {
         const overlap = this.computeOverlap(sentences[i], sentences[j]);
-        if (overlap > 0.6) {
+        if (false) {
           const start = text.indexOf(sentences[j]);
           issues.push({
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] EqualityOperator
src/services/CircularLogicDetector.ts:17:13
     for (let i = 0; i < sentences.length; i++) {
       for (let j = i + 1; j < sentences.length; j++) {
         const overlap = this.computeOverlap(sentences[i], sentences[j]);
-        if (overlap > 0.6) {
+        if (overlap <= 0.6) {
           const start = text.indexOf(sentences[j]);
           issues.push({
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Survived] ArithmeticOperator
src/services/CircularLogicDetector.ts:21:37
           const start = text.indexOf(sentences[j]);
           issues.push({
             type: 'circular_logic',
-            position: { start, end: start + sentences[j].length },
+            position: { start, end: start - sentences[j].length },
             lineNumber: this.getLineNumber(text, start),
             flaggedText: sentences[j].substring(0, 80),

[Survived] MethodExpression
src/services/CircularLogicDetector.ts:23:26
             type: 'circular_logic',
             position: { start, end: start + sentences[j].length },
             lineNumber: this.getLineNumber(text, start),
-            flaggedText: sentences[j].substring(0, 80),
+            flaggedText: sentences[j],
             explanation: `This argument repeats a point made earlier in the draft (see sentence ${i + 1}).`,
             severity: 'medium',

[Survived] ArithmeticOperator
src/services/CircularLogicDetector.ts:24:99
             position: { start, end: start + sentences[j].length },
             lineNumber: this.getLineNumber(text, start),
             flaggedText: sentences[j].substring(0, 80),
-            explanation: `This argument repeats a point made earlier in the draft (see sentence ${i + 1}).`,
+            explanation: `This argument repeats a point made earlier in the draft (see sentence ${i - 1}).`,
             severity: 'medium',
             confidence: Math.min(0.95, overlap),

[Survived] MethodExpression
src/services/CircularLogicDetector.ts:26:25
             flaggedText: sentences[j].substring(0, 80),
             explanation: `This argument repeats a point made earlier in the draft (see sentence ${i + 1}).`,
             severity: 'medium',
-            confidence: Math.min(0.95, overlap),
+            confidence: Math.max(0.95, overlap),
           });
         }

[Survived] Regex
src/services/CircularLogicDetector.ts:36:7
     const selfRefPatterns = [
       /I already (said|mentioned|stated)/i,
       /as I (said|mentioned|stated) (before|earlier|above)/i,
-      /this proves .* because .* this/i,
+      /this proves .* because . this/i,
     ];
 

[Killed] BlockStatement
src/services/CircularLogicDetector.ts:39:44
       /this proves .* because .* this/i,
     ];
 
-    for (const pattern of selfRefPatterns) {
-      const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
-        issues.push({
-          type: 'circular_logic',
-          position: { start: match.index, end: match.index + match[0].length },
-          lineNumber: this.getLineNumber(text, match.index),
-          flaggedText: match[0],
-          explanation: 'This repeats a point already made without adding new information or evidence.',
-          severity: 'medium',
-          confidence: 0.82,
-        });
-      }
-    }
+    for (const pattern of selfRefPatterns) {}
 
     return issues;
killedBy: CircularLogicDetector should detect "I already said" pattern
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/services/CircularLogicDetector.ts:41:20
 
     for (const pattern of selfRefPatterns) {
       const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
+      if (match && match.index === undefined) {
         issues.push({
           type: 'circular_logic',
killedBy: CircularLogicDetector should detect "I already said" pattern
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/services/CircularLogicDetector.ts:41:47
 
     for (const pattern of selfRefPatterns) {
       const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
-        issues.push({
-          type: 'circular_logic',
-          position: { start: match.index, end: match.index + match[0].length },
-          lineNumber: this.getLineNumber(text, match.index),
-          flaggedText: match[0],
-          explanation: 'This repeats a point already made without adding new information or evidence.',
-          severity: 'medium',
-          confidence: 0.82,
-        });
-      }
+      if (match && match.index !== undefined) {}
     }
 
killedBy: CircularLogicDetector should detect "I already said" pattern
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArithmeticOperator
src/services/CircularLogicDetector.ts:44:48
       if (match && match.index !== undefined) {
         issues.push({
           type: 'circular_logic',
-          position: { start: match.index, end: match.index + match[0].length },
+          position: { start: match.index, end: match.index - match[0].length },
           lineNumber: this.getLineNumber(text, match.index),
           flaggedText: match[0],
killedBy: CircularLogicDetector should report correct position for flagged text
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 16
Received:   0

[Survived] StringLiteral
src/services/CircularLogicDetector.ts:47:24
           position: { start: match.index, end: match.index + match[0].length },
           lineNumber: this.getLineNumber(text, match.index),
           flaggedText: match[0],
-          explanation: 'This repeats a point already made without adding new information or evidence.',
+          explanation: "",
           severity: 'medium',
           confidence: 0.82,

[Killed] MethodExpression
src/services/CircularLogicDetector.ts:58:28
   }
 
   private computeOverlap(a: string, b: string): number {
-    const wordsA = new Set(a.toLowerCase().split(/\s+/));
+    const wordsA = new Set(a.toUpperCase().split(/\s+/));
     const wordsB = new Set(b.toLowerCase().split(/\s+/));
     let intersection = 0;
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] MethodExpression
src/services/CircularLogicDetector.ts:59:28
 
   private computeOverlap(a: string, b: string): number {
     const wordsA = new Set(a.toLowerCase().split(/\s+/));
-    const wordsB = new Set(b.toLowerCase().split(/\s+/));
+    const wordsB = new Set(b.toUpperCase().split(/\s+/));
     let intersection = 0;
     for (const w of wordsA) {
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Survived] Regex
src/services/CircularLogicDetector.ts:59:50
 
   private computeOverlap(a: string, b: string): number {
     const wordsA = new Set(a.toLowerCase().split(/\s+/));
-    const wordsB = new Set(b.toLowerCase().split(/\s+/));
+    const wordsB = new Set(b.toLowerCase().split(/\s/));
     let intersection = 0;
     for (const w of wordsA) {

[Killed] BlockStatement
src/services/CircularLogicDetector.ts:61:29
     const wordsA = new Set(a.toLowerCase().split(/\s+/));
     const wordsB = new Set(b.toLowerCase().split(/\s+/));
     let intersection = 0;
-    for (const w of wordsA) {
-      if (wordsB.has(w)) intersection++;
-    }
+    for (const w of wordsA) {}
     return intersection / Math.max(wordsA.size, wordsB.size);
   }
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ConditionalExpression
src/services/CircularLogicDetector.ts:62:11
     const wordsB = new Set(b.toLowerCase().split(/\s+/));
     let intersection = 0;
     for (const w of wordsA) {
-      if (wordsB.has(w)) intersection++;
+      if (true) intersection++;
     }
     return intersection / Math.max(wordsA.size, wordsB.size);
killedBy: CircularLogicDetector should not flag unrelated sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/services/CircularLogicDetector.ts:62:11
     const wordsB = new Set(b.toLowerCase().split(/\s+/));
     let intersection = 0;
     for (const w of wordsA) {
-      if (wordsB.has(w)) intersection++;
+      if (false) intersection++;
     }
     return intersection / Math.max(wordsA.size, wordsB.size);
killedBy: CircularLogicDetector should detect repeated sentences with high word overlap
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ArithmeticOperator
src/services/CircularLogicDetector.ts:64:12
     for (const w of wordsA) {
       if (wordsB.has(w)) intersection++;
     }
-    return intersection / Math.max(wordsA.size, wordsB.size);
+    return intersection * Math.max(wordsA.size, wordsB.size);
   }
 
killedBy: CircularLogicDetector should not flag unrelated sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Survived] MethodExpression
src/services/CircularLogicDetector.ts:64:27
     for (const w of wordsA) {
       if (wordsB.has(w)) intersection++;
     }
-    return intersection / Math.max(wordsA.size, wordsB.size);
+    return intersection / Math.min(wordsA.size, wordsB.size);
   }
 

[Survived] MethodExpression
src/services/CircularLogicDetector.ts:68:12
   }
 
   private getLineNumber(text: string, position: number): number {
-    return text.substring(0, position).split('\n').length;
+    return text.split('\n').length;
   }
 }

[Survived] StringLiteral
src/services/CircularLogicDetector.ts:68:46
   }
 
   private getLineNumber(text: string, position: number): number {
-    return text.substring(0, position).split('\n').length;
+    return text.substring(0, position).split("").length;
   }
 }
