[Survived] ArrowFunction
src/services/InMemoryCacheService.ts:22:40
     this.store = new Map();
     this.maxEntries = maxEntries;
     this.sweepIntervalMs = sweepIntervalMs;
-    this.sweepIntervalId = setInterval(() => this.sweepExpired(), this.sweepIntervalMs);
+    this.sweepIntervalId = setInterval(() => undefined, this.sweepIntervalMs);
     this.checkRep();
   }

[Killed] EqualityOperator
src/services/InMemoryCacheService.ts:29:9
   async get<T = object>(key: string): Promise<T | null> {
     const entry = this.store.get(key);
     if (!entry) return null;
-    if (Date.now() > entry.expiresAt) {
+    if (Date.now() <= entry.expiresAt) {
       this.store.delete(key);
       return null;
killedBy: InMemoryCacheService should store and retrieve a value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "Alice"}
Received: null

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:29:39
   async get<T = object>(key: string): Promise<T | null> {
     const entry = this.store.get(key);
     if (!entry) return null;
-    if (Date.now() > entry.expiresAt) {
-      this.store.delete(key);
-      return null;
-    }
+    if (Date.now() > entry.expiresAt) {}
     return structuredClone(entry.value) as T;
   }
killedBy: InMemoryCacheService should return null for an expired entry
statusReason: Error: expect(received).toBeNull()

Received: {"x": 1}

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:36:75
     return structuredClone(entry.value) as T;
   }
 
-  async set(key: string, value: object, ttlSeconds = 3600): Promise<void> {
-    if (this.store.size >= this.maxEntries && !this.store.has(key)) {
-      this.sweepExpired();
-      if (this.store.size >= this.maxEntries) {
-        // Evict oldest entry
-        const oldestKey = this.store.keys().next().value;
-        if (oldestKey !== undefined) {
-          this.store.delete(oldestKey);
-        }
-      }
-    }
-    this.store.set(key, {
-      value: structuredClone(value),
-      expiresAt: Date.now() + ttlSeconds * 1000,
-    });
-    this.checkRep();
-  }
+  async set(key: string, value: object, ttlSeconds = 3600): Promise<void> {}
 
   async delete(key: string): Promise<void> {
killedBy: InMemoryCacheService should store and retrieve a value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "Alice"}
Received: null

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:37:69
   }
 
   async set(key: string, value: object, ttlSeconds = 3600): Promise<void> {
-    if (this.store.size >= this.maxEntries && !this.store.has(key)) {
-      this.sweepExpired();
-      if (this.store.size >= this.maxEntries) {
-        // Evict oldest entry
-        const oldestKey = this.store.keys().next().value;
-        if (oldestKey !== undefined) {
-          this.store.delete(oldestKey);
-        }
-      }
-    }
+    if (this.store.size >= this.maxEntries && !this.store.has(key)) {}
     this.store.set(key, {
       value: structuredClone(value),
killedBy: InMemoryCacheService should evict the oldest entry when at max capacity
statusReason: Error: expect(received).toBeNull()

Received: {"n": 1}

[Killed] EqualityOperator
src/services/InMemoryCacheService.ts:37:9
   }
 
   async set(key: string, value: object, ttlSeconds = 3600): Promise<void> {
-    if (this.store.size >= this.maxEntries && !this.store.has(key)) {
+    if (this.store.size > this.maxEntries && !this.store.has(key)) {
       this.sweepExpired();
       if (this.store.size >= this.maxEntries) {
killedBy: InMemoryCacheService should evict the oldest entry when at max capacity
statusReason: Error: expect(received).toBeNull()

Received: {"n": 1}

[Killed] EqualityOperator
src/services/InMemoryCacheService.ts:39:11
   async set(key: string, value: object, ttlSeconds = 3600): Promise<void> {
     if (this.store.size >= this.maxEntries && !this.store.has(key)) {
       this.sweepExpired();
-      if (this.store.size >= this.maxEntries) {
+      if (this.store.size < this.maxEntries) {
         // Evict oldest entry
         const oldestKey = this.store.keys().next().value;
killedBy: InMemoryCacheService should evict the oldest entry when at max capacity
statusReason: Error: expect(received).toBeNull()

Received: {"n": 1}

[Killed] EqualityOperator
src/services/InMemoryCacheService.ts:39:11
   async set(key: string, value: object, ttlSeconds = 3600): Promise<void> {
     if (this.store.size >= this.maxEntries && !this.store.has(key)) {
       this.sweepExpired();
-      if (this.store.size >= this.maxEntries) {
+      if (this.store.size > this.maxEntries) {
         // Evict oldest entry
         const oldestKey = this.store.keys().next().value;
killedBy: InMemoryCacheService should evict the oldest entry when at max capacity
statusReason: Error: expect(received).toBeNull()

Received: {"n": 1}

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:42:38
       if (this.store.size >= this.maxEntries) {
         // Evict oldest entry
         const oldestKey = this.store.keys().next().value;
-        if (oldestKey !== undefined) {
-          this.store.delete(oldestKey);
-        }
+        if (oldestKey !== undefined) {}
       }
     }
killedBy: InMemoryCacheService should evict the oldest entry when at max capacity
statusReason: Error: expect(received).toBeNull()

Received: {"n": 1}

[Killed] ArithmeticOperator
src/services/InMemoryCacheService.ts:49:18
     }
     this.store.set(key, {
       value: structuredClone(value),
-      expiresAt: Date.now() + ttlSeconds * 1000,
+      expiresAt: Date.now() - ttlSeconds * 1000,
     });
     this.checkRep();
killedBy: InMemoryCacheService should store and retrieve a value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "Alice"}
Received: null

[Killed] ArithmeticOperator
src/services/InMemoryCacheService.ts:49:31
     }
     this.store.set(key, {
       value: structuredClone(value),
-      expiresAt: Date.now() + ttlSeconds * 1000,
+      expiresAt: Date.now() + ttlSeconds / 1000,
     });
     this.checkRep();
killedBy: InMemoryCacheService should remove all expired entries
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"v": 3}
Received: null

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:54:44
     this.checkRep();
   }
 
-  async delete(key: string): Promise<void> {
-    this.store.delete(key);
-  }
+  async delete(key: string): Promise<void> {}
 
   async exists(key: string): Promise<boolean> {
killedBy: InMemoryCacheService should delete a key
statusReason: Error: expect(received).toBeNull()

Received: {"x": 1}

[Killed] BooleanLiteral
src/services/InMemoryCacheService.ts:60:24
 
   async exists(key: string): Promise<boolean> {
     const entry = this.store.get(key);
-    if (!entry) return false;
+    if (!entry) return true;
     if (Date.now() > entry.expiresAt) {
       this.store.delete(key);
killedBy: InMemoryCacheService should return false for a missing key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/InMemoryCacheService.ts:61:9
   async exists(key: string): Promise<boolean> {
     const entry = this.store.get(key);
     if (!entry) return false;
-    if (Date.now() > entry.expiresAt) {
+    if (Date.now() <= entry.expiresAt) {
       this.store.delete(key);
       return false;
killedBy: InMemoryCacheService should return true for an existing key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:61:39
   async exists(key: string): Promise<boolean> {
     const entry = this.store.get(key);
     if (!entry) return false;
-    if (Date.now() > entry.expiresAt) {
-      this.store.delete(key);
-      return false;
-    }
+    if (Date.now() > entry.expiresAt) {}
     return true;
   }
killedBy: InMemoryCacheService should return false for an expired key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/InMemoryCacheService.ts:63:14
     if (!entry) return false;
     if (Date.now() > entry.expiresAt) {
       this.store.delete(key);
-      return false;
+      return true;
     }
     return true;
killedBy: InMemoryCacheService should return false for an expired key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BlockStatement
src/services/InMemoryCacheService.ts:68:24
     return true;
   }
 
-  sweepExpired(): void {
-    const now = Date.now();
-    for (const [key, entry] of this.store) {
-      if (now > entry.expiresAt) {
-        this.store.delete(key);
-      }
-    }
-  }
+  sweepExpired(): void {}
 
   destroy(): void {

[Survived] BlockStatement
src/services/InMemoryCacheService.ts:70:44
 
   sweepExpired(): void {
     const now = Date.now();
-    for (const [key, entry] of this.store) {
-      if (now > entry.expiresAt) {
-        this.store.delete(key);
-      }
-    }
+    for (const [key, entry] of this.store) {}
   }
 

[Killed] EqualityOperator
src/services/InMemoryCacheService.ts:71:11
   sweepExpired(): void {
     const now = Date.now();
     for (const [key, entry] of this.store) {
-      if (now > entry.expiresAt) {
+      if (now <= entry.expiresAt) {
         this.store.delete(key);
       }
killedBy: InMemoryCacheService should remove all expired entries
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"v": 3}
Received: null

[Killed] ConditionalExpression
src/services/InMemoryCacheService.ts:71:11
   sweepExpired(): void {
     const now = Date.now();
     for (const [key, entry] of this.store) {
-      if (now > entry.expiresAt) {
+      if (true) {
         this.store.delete(key);
       }
killedBy: InMemoryCacheService should remove all expired entries
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"v": 3}
Received: null

[Killed] BlockStatement
src/services/InMemoryCacheService.ts:77:19
     }
   }
 
-  destroy(): void {
-    if (this.sweepIntervalId) {
-      clearInterval(this.sweepIntervalId);
-      this.sweepIntervalId = null;
-    }
-    this.store.clear();
-  }
+  destroy(): void {}
 
   private checkRep(): void {
killedBy: InMemoryCacheService should clear all entries on destroy
statusReason: Error: expect(received).toBeNull()

Received: {"v": 1}

[Survived] BlockStatement
src/services/InMemoryCacheService.ts:78:31
   }
 
   destroy(): void {
-    if (this.sweepIntervalId) {
-      clearInterval(this.sweepIntervalId);
-      this.sweepIntervalId = null;
-    }
+    if (this.sweepIntervalId) {}
     this.store.clear();
   }

[Survived] BlockStatement
src/services/InMemoryCacheService.ts:85:28
     this.store.clear();
   }
 
-  private checkRep(): void {
-    if (process.env.NODE_ENV === 'production') return;
-    console.assert(this.maxEntries > 0, 'maxEntries must be positive');
-    console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
-    console.assert(this.store.size <= this.maxEntries,
-      `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
-    for (const [key, entry] of this.store) {
-      console.assert(key.length > 0, 'cache key must be non-empty');
-      console.assert(entry.value !== null && entry.value !== undefined,
-        `null/undefined value for key "${key}"`);
-      console.assert(entry.expiresAt > 0,
-        `expiresAt must be positive for key "${key}"`);
-    }
-  }
+  private checkRep(): void {}
 }
 

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:86:9
   }
 
   private checkRep(): void {
-    if (process.env.NODE_ENV === 'production') return;
+    if (false) return;
     console.assert(this.maxEntries > 0, 'maxEntries must be positive');
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');

[Survived] EqualityOperator
src/services/InMemoryCacheService.ts:86:9
   }
 
   private checkRep(): void {
-    if (process.env.NODE_ENV === 'production') return;
+    if (process.env.NODE_ENV !== 'production') return;
     console.assert(this.maxEntries > 0, 'maxEntries must be positive');
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');

[Survived] EqualityOperator
src/services/InMemoryCacheService.ts:87:20
 
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
-    console.assert(this.maxEntries > 0, 'maxEntries must be positive');
+    console.assert(this.maxEntries >= 0, 'maxEntries must be positive');
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
     console.assert(this.store.size <= this.maxEntries,

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:87:20
 
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
-    console.assert(this.maxEntries > 0, 'maxEntries must be positive');
+    console.assert(true, 'maxEntries must be positive');
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
     console.assert(this.store.size <= this.maxEntries,

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:88:20
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.maxEntries > 0, 'maxEntries must be positive');
-    console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
+    console.assert(false, 'sweepIntervalMs must be positive');
     console.assert(this.store.size <= this.maxEntries,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);

[Survived] EqualityOperator
src/services/InMemoryCacheService.ts:88:20
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.maxEntries > 0, 'maxEntries must be positive');
-    console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
+    console.assert(this.sweepIntervalMs <= 0, 'sweepIntervalMs must be positive');
     console.assert(this.store.size <= this.maxEntries,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:89:20
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.maxEntries > 0, 'maxEntries must be positive');
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
-    console.assert(this.store.size <= this.maxEntries,
+    console.assert(false,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
     for (const [key, entry] of this.store) {

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:89:20
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.maxEntries > 0, 'maxEntries must be positive');
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
-    console.assert(this.store.size <= this.maxEntries,
+    console.assert(true,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
     for (const [key, entry] of this.store) {

[Survived] BlockStatement
src/services/InMemoryCacheService.ts:91:44
     console.assert(this.sweepIntervalMs > 0, 'sweepIntervalMs must be positive');
     console.assert(this.store.size <= this.maxEntries,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
-    for (const [key, entry] of this.store) {
-      console.assert(key.length > 0, 'cache key must be non-empty');
-      console.assert(entry.value !== null && entry.value !== undefined,
-        `null/undefined value for key "${key}"`);
-      console.assert(entry.expiresAt > 0,
-        `expiresAt must be positive for key "${key}"`);
-    }
+    for (const [key, entry] of this.store) {}
   }
 }

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:92:22
     console.assert(this.store.size <= this.maxEntries,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
     for (const [key, entry] of this.store) {
-      console.assert(key.length > 0, 'cache key must be non-empty');
+      console.assert(true, 'cache key must be non-empty');
       console.assert(entry.value !== null && entry.value !== undefined,
         `null/undefined value for key "${key}"`);

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:92:22
     console.assert(this.store.size <= this.maxEntries,
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
     for (const [key, entry] of this.store) {
-      console.assert(key.length > 0, 'cache key must be non-empty');
+      console.assert(false, 'cache key must be non-empty');
       console.assert(entry.value !== null && entry.value !== undefined,
         `null/undefined value for key "${key}"`);

[Survived] EqualityOperator
src/services/InMemoryCacheService.ts:93:22
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
     for (const [key, entry] of this.store) {
       console.assert(key.length > 0, 'cache key must be non-empty');
-      console.assert(entry.value !== null && entry.value !== undefined,
+      console.assert(entry.value === null && entry.value !== undefined,
         `null/undefined value for key "${key}"`);
       console.assert(entry.expiresAt > 0,

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:93:22
       `store size ${this.store.size} exceeds cap ${this.maxEntries}`);
     for (const [key, entry] of this.store) {
       console.assert(key.length > 0, 'cache key must be non-empty');
-      console.assert(entry.value !== null && entry.value !== undefined,
+      console.assert(true,
         `null/undefined value for key "${key}"`);
       console.assert(entry.expiresAt > 0,

[Survived] ConditionalExpression
src/services/InMemoryCacheService.ts:95:22
       console.assert(key.length > 0, 'cache key must be non-empty');
       console.assert(entry.value !== null && entry.value !== undefined,
         `null/undefined value for key "${key}"`);
-      console.assert(entry.expiresAt > 0,
+      console.assert(true,
         `expiresAt must be positive for key "${key}"`);
     }

[Survived] EqualityOperator
src/services/InMemoryCacheService.ts:95:22
       console.assert(key.length > 0, 'cache key must be non-empty');
       console.assert(entry.value !== null && entry.value !== undefined,
         `null/undefined value for key "${key}"`);
-      console.assert(entry.expiresAt > 0,
+      console.assert(entry.expiresAt <= 0,
         `expiresAt must be positive for key "${key}"`);
     }

[Survived] StringLiteral
src/services/InMemoryCacheService.ts:96:9
       console.assert(entry.value !== null && entry.value !== undefined,
         `null/undefined value for key "${key}"`);
       console.assert(entry.expiresAt > 0,
-        `expiresAt must be positive for key "${key}"`);
+        ``);
     }
   }
