[Killed] MethodExpression
src/services/MockAIAnalysisService.ts:13:22
 export class MockAIAnalysisService implements IAIAnalysisService {
   async extractClaims(text: string): Promise<Claim[]> {
     return [
-      { id: 1, text: text.substring(0, 60), supportingEvidence: ['mock-ev-1'] },
+      { id: 1, text: text, supportingEvidence: ['mock-ev-1'] },
     ];
   }
killedBy: MockAIAnalysisService should use the first 60 characters as claim text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
Received: "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"

[Killed] StringLiteral
src/services/MockAIAnalysisService.ts:13:66
 export class MockAIAnalysisService implements IAIAnalysisService {
   async extractClaims(text: string): Promise<Claim[]> {
     return [
-      { id: 1, text: text.substring(0, 60), supportingEvidence: ['mock-ev-1'] },
+      { id: 1, text: text.substring(0, 60), supportingEvidence: [""] },
     ];
   }
killedBy: MockAIAnalysisService should include mock supporting evidence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "mock-ev-1",
+   "",

[Killed] ConditionalExpression
src/services/MockAIAnalysisService.ts:19:36
 
   async extractEvidence(text: string): Promise<EvidenceBlock[]> {
     const strength: EvidenceBlock['strength'] =
-      text.length > 200 ? 'high' : text.length > 100 ? 'medium' : 'low';
+      text.length > 200 ? 'high' : false ? 'medium' : 'low';
     return [
       {
killedBy: MockAIAnalysisService should return "medium" strength for text 100–200 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "medium"
Received: "low"

[Killed] EqualityOperator
src/services/MockAIAnalysisService.ts:19:36
 
   async extractEvidence(text: string): Promise<EvidenceBlock[]> {
     const strength: EvidenceBlock['strength'] =
-      text.length > 200 ? 'high' : text.length > 100 ? 'medium' : 'low';
+      text.length > 200 ? 'high' : text.length <= 100 ? 'medium' : 'low';
     return [
       {
killedBy: MockAIAnalysisService should return "low" strength for text < 100 characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "low"
Received: "medium"

[Killed] ArrayDeclaration
src/services/MockAIAnalysisService.ts:20:12
   async extractEvidence(text: string): Promise<EvidenceBlock[]> {
     const strength: EvidenceBlock['strength'] =
       text.length > 200 ? 'high' : text.length > 100 ? 'medium' : 'low';
-    return [
-      {
-        type: 'anecdote',
-        content: 'Mock evidence from text analysis',
-        strength,
-      },
-    ];
+    return [];
   }
 
killedBy: MockAIAnalysisService should return "low" strength for text < 100 characters
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] OptionalChaining
src/services/MockAIAnalysisService.ts:37:23
   }
 
   async generateSummary(analysis: AnalysisResult): Promise<string> {
-    const claimText = analysis.claims[0]?.text ?? 'No claims found';
+    const claimText = analysis.claims[0].text ?? 'No claims found';
     return `Mock summary: Argues "${claimText}" with ${analysis.evidence.length} piece(s) of evidence.`;
   }
killedBy: MockAIAnalysisService should handle empty claims gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'text')

[Killed] LogicalOperator
src/services/MockAIAnalysisService.ts:37:23
   }
 
   async generateSummary(analysis: AnalysisResult): Promise<string> {
-    const claimText = analysis.claims[0]?.text ?? 'No claims found';
+    const claimText = analysis.claims[0]?.text && 'No claims found';
     return `Mock summary: Argues "${claimText}" with ${analysis.evidence.length} piece(s) of evidence.`;
   }
killedBy: MockAIAnalysisService should produce a summary using the first claim text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Mock summary: Argues \"Climate change is real\" with 1 piece(s) of evidence."
Received: "Mock summary: Argues \"No claims found\" with 1 piece(s) of evidence."

[Killed] StringLiteral
src/services/MockAIAnalysisService.ts:38:12
 
   async generateSummary(analysis: AnalysisResult): Promise<string> {
     const claimText = analysis.claims[0]?.text ?? 'No claims found';
-    return `Mock summary: Argues "${claimText}" with ${analysis.evidence.length} piece(s) of evidence.`;
+    return ``;
   }
 }
killedBy: MockAIAnalysisService should produce a summary using the first claim text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Mock summary: Argues \"Climate change is real\" with 1 piece(s) of evidence."
Received: ""
