[Killed] BlockStatement
src/services/ReasoningSummaryService.ts:27:16
 
     // 2. Check DB
     const dbRow = await this.summaryRepo.findByCommentId(commentId);
-    if (dbRow) {
-      const dto = this.buildDTO(dbRow);
-      await this.cache.set(cacheKey, dto as unknown as object, env.CACHE_REASONING_TTL);
-      return dto;
-    }
+    if (dbRow) {}
 
     // 3. Fetch comment and generate
killedBy: ReasoningSummaryService should return DB summary when cache misses
statusReason: Error: No comment found with id 42

[Killed] StringLiteral
src/services/ReasoningSummaryService.ts:46:22
   }
 
   async generateAndCacheSummary(comment: Comment): Promise<ReasoningSummaryDTO> {
-    const cacheKey = `reasoning_summary:${comment.id}`;
+    const cacheKey = ``;
 
     const [claims, evidence] = await Promise.all([
killedBy: ReasoningSummaryService should generate, persist, and cache summary from a comment object
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Survived] OptionalChaining
src/services/ReasoningSummaryService.ts:55:26
     const coherenceScore = await this.aiService.evaluateCoherence(claims, evidence);
     const summary = await this.aiService.generateSummary({ claims, evidence, coherenceScore });
 
-    const primaryClaim = claims[0]?.text ?? 'No primary claim identified';
+    const primaryClaim = claims[0].text ?? 'No primary claim identified';
 
     const row = await this.summaryRepo.upsert({

[Survived] LogicalOperator
src/services/ReasoningSummaryService.ts:55:26
     const coherenceScore = await this.aiService.evaluateCoherence(claims, evidence);
     const summary = await this.aiService.generateSummary({ claims, evidence, coherenceScore });
 
-    const primaryClaim = claims[0]?.text ?? 'No primary claim identified';
+    const primaryClaim = claims[0]?.text && 'No primary claim identified';
 
     const row = await this.summaryRepo.upsert({

[Killed] BlockStatement
src/services/ReasoningSummaryService.ts:70:59
     return dto;
   }
 
-  async invalidateCache(commentId: number): Promise<void> {
-    const cacheKey = `reasoning_summary:${commentId}`;
-    await this.cache.delete(cacheKey);
-    await this.summaryRepo.deleteByCommentId(commentId);
-  }
+  async invalidateCache(commentId: number): Promise<void> {}
 
   private buildDTO(row: ReasoningSummaryRow): ReasoningSummaryDTO {
killedBy: ReasoningSummaryService should delete cache entry and DB row
statusReason: Error: expect(received).toBeNull()

Received: {"test": true}

[Survived] LogicalOperator
src/services/ReasoningSummaryService.ts:83:20
       primaryClaim: row.primary_claim,
       evidenceBlocks: row.evidence_blocks,
       coherenceScore: parseFloat(row.coherence_score),
-      generatedAt: row.updated_at ?? row.created_at,
+      generatedAt: row.updated_at && row.created_at,
     };
   }
