[Killed] Regex
src/services/UnsupportedClaimsDetector.ts:16:18
     // Detect absolute claims
     const absolutePatterns: Array<{ pattern: RegExp; explanation: string }> = [
       {
-        pattern: /\b(all|every|always|never|none|nobody|no one)\b.*\b(is|are|was|were|do|does|will|would|can|could|should|must)\b/i,
+        pattern: /\b(all|every|always|never|none|nobody|no one)\b.\b(is|are|was|were|do|does|will|would|can|could|should|must)\b/i,
         explanation: 'Absolute claim without qualification. Consider using "most", "many", or "often" and providing evidence.',
       },
killedBy: UnsupportedClaimsDetector should flag "all developers are wrong" (absolute + no evidence)
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] BlockStatement
src/services/UnsupportedClaimsDetector.ts:25:62
       },
     ];
 
-    for (const { pattern, explanation } of absolutePatterns) {
-      const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
-        // Check if there's evidence nearby (within ~100 chars)
-        const surrounding = text.substring(
-          Math.max(0, match.index - 50),
-          Math.min(text.length, match.index + match[0].length + 100)
-        );
-        const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);
-
-        if (!hasEvidence) {
-          issues.push({
-            type: 'unsupported_claim',
-            position: { start: match.index, end: match.index + match[0].length },
-            lineNumber: this.getLineNumber(text, match.index),
-            flaggedText: text.substring(match.index, Math.min(text.length, match.index + 80)),
-            explanation,
-            severity: 'high',
-            confidence: 0.85,
-          });
-        }
-      }
-    }
+    for (const { pattern, explanation } of absolutePatterns) {}
 
     return issues;
killedBy: UnsupportedClaimsDetector should flag "all developers are wrong" (absolute + no evidence)
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] BlockStatement
src/services/UnsupportedClaimsDetector.ts:27:47
 
     for (const { pattern, explanation } of absolutePatterns) {
       const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
-        // Check if there's evidence nearby (within ~100 chars)
-        const surrounding = text.substring(
-          Math.max(0, match.index - 50),
-          Math.min(text.length, match.index + match[0].length + 100)
-        );
-        const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);
-
-        if (!hasEvidence) {
-          issues.push({
-            type: 'unsupported_claim',
-            position: { start: match.index, end: match.index + match[0].length },
-            lineNumber: this.getLineNumber(text, match.index),
-            flaggedText: text.substring(match.index, Math.min(text.length, match.index + 80)),
-            explanation,
-            severity: 'high',
-            confidence: 0.85,
-          });
-        }
-      }
+      if (match && match.index !== undefined) {}
     }
 
killedBy: UnsupportedClaimsDetector should flag "all developers are wrong" (absolute + no evidence)
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Survived] MethodExpression
src/services/UnsupportedClaimsDetector.ts:29:29
       const match = pattern.exec(text);
       if (match && match.index !== undefined) {
         // Check if there's evidence nearby (within ~100 chars)
-        const surrounding = text.substring(
-          Math.max(0, match.index - 50),
-          Math.min(text.length, match.index + match[0].length + 100)
-        );
+        const surrounding = text;
         const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);
 

[Killed] ArithmeticOperator
src/services/UnsupportedClaimsDetector.ts:30:23
       if (match && match.index !== undefined) {
         // Check if there's evidence nearby (within ~100 chars)
         const surrounding = text.substring(
-          Math.max(0, match.index - 50),
+          Math.max(0, match.index + 50),
           Math.min(text.length, match.index + match[0].length + 100)
         );
killedBy: UnsupportedClaimsDetector should NOT flag an absolute claim if evidence is within 100 chars
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Survived] MethodExpression
src/services/UnsupportedClaimsDetector.ts:30:11
       if (match && match.index !== undefined) {
         // Check if there's evidence nearby (within ~100 chars)
         const surrounding = text.substring(
-          Math.max(0, match.index - 50),
+          Math.min(0, match.index - 50),
           Math.min(text.length, match.index + match[0].length + 100)
         );

[Killed] ArithmeticOperator
src/services/UnsupportedClaimsDetector.ts:31:33
         // Check if there's evidence nearby (within ~100 chars)
         const surrounding = text.substring(
           Math.max(0, match.index - 50),
-          Math.min(text.length, match.index + match[0].length + 100)
+          Math.min(text.length, match.index + match[0].length - 100)
         );
         const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);
killedBy: UnsupportedClaimsDetector should NOT flag an absolute claim if evidence is within 100 chars
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Survived] ArithmeticOperator
src/services/UnsupportedClaimsDetector.ts:31:33
         // Check if there's evidence nearby (within ~100 chars)
         const surrounding = text.substring(
           Math.max(0, match.index - 50),
-          Math.min(text.length, match.index + match[0].length + 100)
+          Math.min(text.length, match.index - match[0].length + 100)
         );
         const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);

[Killed] ConditionalExpression
src/services/UnsupportedClaimsDetector.ts:35:13
         );
         const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);
 
-        if (!hasEvidence) {
+        if (true) {
           issues.push({
             type: 'unsupported_claim',
killedBy: UnsupportedClaimsDetector should NOT flag an absolute claim if evidence is within 100 chars
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1

[Killed] BlockStatement
src/services/UnsupportedClaimsDetector.ts:35:27
         );
         const hasEvidence = /according to|study|survey|data|research|report|percent|%|\d{4}/.test(surrounding);
 
-        if (!hasEvidence) {
-          issues.push({
-            type: 'unsupported_claim',
-            position: { start: match.index, end: match.index + match[0].length },
-            lineNumber: this.getLineNumber(text, match.index),
-            flaggedText: text.substring(match.index, Math.min(text.length, match.index + 80)),
-            explanation,
-            severity: 'high',
-            confidence: 0.85,
-          });
-        }
+        if (!hasEvidence) {}
       }
     }
killedBy: UnsupportedClaimsDetector should flag "all developers are wrong" (absolute + no evidence)
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Survived] ArithmeticOperator
src/services/UnsupportedClaimsDetector.ts:38:50
         if (!hasEvidence) {
           issues.push({
             type: 'unsupported_claim',
-            position: { start: match.index, end: match.index + match[0].length },
+            position: { start: match.index, end: match.index - match[0].length },
             lineNumber: this.getLineNumber(text, match.index),
             flaggedText: text.substring(match.index, Math.min(text.length, match.index + 80)),

[Survived] MethodExpression
src/services/UnsupportedClaimsDetector.ts:40:54
             type: 'unsupported_claim',
             position: { start: match.index, end: match.index + match[0].length },
             lineNumber: this.getLineNumber(text, match.index),
-            flaggedText: text.substring(match.index, Math.min(text.length, match.index + 80)),
+            flaggedText: text.substring(match.index, Math.max(text.length, match.index + 80)),
             explanation,
             severity: 'high',

[Survived] MethodExpression
src/services/UnsupportedClaimsDetector.ts:40:26
             type: 'unsupported_claim',
             position: { start: match.index, end: match.index + match[0].length },
             lineNumber: this.getLineNumber(text, match.index),
-            flaggedText: text.substring(match.index, Math.min(text.length, match.index + 80)),
+            flaggedText: text,
             explanation,
             severity: 'high',
