[Killed] ArrayDeclaration
src/services/WeakEvidenceDetector.ts:11:75
     const issues: Issue[] = [];
 
     // Detect appeal-to-popularity patterns
-    const weakPatterns: Array<{ pattern: RegExp; explanation: string }> = [
-      {
-        pattern: /everyone (knows|agrees|says|thinks|believes)/i,
-        explanation: "Appeal to popularity — 'everyone' is not evidence of quality. Cite specific data or surveys.",
-      },
-      {
-        pattern: /all (scientists|experts|developers|researchers) (agree|think|say|believe)/i,
-        explanation: 'Sweeping generalization without specific citations. Reference a particular study or survey.',
-      },
-      {
-        pattern: /it\'?s (obvious|clear|well-known|common knowledge) that/i,
-        explanation: 'Assertion presented as self-evident without supporting evidence.',
-      },
-      {
-        pattern: /because (everyone|everybody|people|they) (use|uses|like|likes|prefer|prefers) it/i,
-        explanation: "Appeal to popularity — widespread use doesn't prove quality. Provide metrics or comparisons.",
-      },
-      {
-        pattern: /studies (show|prove|demonstrate|suggest)/i,
-        explanation: 'Vague reference to studies without specific citations. Name the study, authors, or publication.',
-      },
-    ];
+    const weakPatterns: Array<{ pattern: RegExp; explanation: string }> = [];
 
     for (const { pattern, explanation } of weakPatterns) {
killedBy: WritingFeedbackService should detect weak evidence issues
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] StringLiteral
src/services/WeakEvidenceDetector.ts:18:22
       },
       {
         pattern: /all (scientists|experts|developers|researchers) (agree|think|say|believe)/i,
-        explanation: 'Sweeping generalization without specific citations. Reference a particular study or survey.',
+        explanation: "",
       },
       {
killedBy: WeakEvidenceDetector should flag "all scientists agree" as sweeping generalization
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Sweeping generalization"
Received string:    ""

[Killed] StringLiteral
src/services/WeakEvidenceDetector.ts:22:22
       },
       {
         pattern: /it\'?s (obvious|clear|well-known|common knowledge) that/i,
-        explanation: 'Assertion presented as self-evident without supporting evidence.',
+        explanation: "",
       },
       {
killedBy: WeakEvidenceDetector should flag "it's obvious that" pattern
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "self-evident"
Received string:    ""

[Killed] BlockStatement
src/services/WeakEvidenceDetector.ts:34:58
       },
     ];
 
-    for (const { pattern, explanation } of weakPatterns) {
-      const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
-        issues.push({
-          type: 'weak_evidence',
-          position: { start: match.index, end: match.index + match[0].length },
-          lineNumber: this.getLineNumber(text, match.index),
-          flaggedText: match[0],
-          explanation,
-          severity: 'medium',
-          confidence: 0.76,
-        });
-      }
-    }
+    for (const { pattern, explanation } of weakPatterns) {}
 
     return issues;
killedBy: WeakEvidenceDetector should flag "everyone knows" as weak evidence
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] BlockStatement
src/services/WeakEvidenceDetector.ts:36:47
 
     for (const { pattern, explanation } of weakPatterns) {
       const match = pattern.exec(text);
-      if (match && match.index !== undefined) {
-        issues.push({
-          type: 'weak_evidence',
-          position: { start: match.index, end: match.index + match[0].length },
-          lineNumber: this.getLineNumber(text, match.index),
-          flaggedText: match[0],
-          explanation,
-          severity: 'medium',
-          confidence: 0.76,
-        });
-      }
+      if (match && match.index !== undefined) {}
     }
 
killedBy: WeakEvidenceDetector should flag "everyone knows" as weak evidence
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

[Killed] ArithmeticOperator
src/services/WeakEvidenceDetector.ts:39:48
       if (match && match.index !== undefined) {
         issues.push({
           type: 'weak_evidence',
-          position: { start: match.index, end: match.index + match[0].length },
+          position: { start: match.index, end: match.index - match[0].length },
           lineNumber: this.getLineNumber(text, match.index),
           flaggedText: match[0],
killedBy: WeakEvidenceDetector should report correct position for flagged text
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 10
Received:   -4
