[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:28:79
   }
 
   registerSession(userId: number, socketId: string): boolean {
-    if (this.sessions.size >= this.maxSessions && !this.sessions.has(userId)) {
-      this.sweepExpiredSessions();
-      if (this.sessions.size >= this.maxSessions) {
-        return false;
-      }
-    }
+    if (this.sessions.size >= this.maxSessions && !this.sessions.has(userId)) {}
     this.sessions.set(userId, {
       socketId,
killedBy: WritingFeedbackSessionManager should reject the 11th session when at capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:28:51
   }
 
   registerSession(userId: number, socketId: string): boolean {
-    if (this.sessions.size >= this.maxSessions && !this.sessions.has(userId)) {
+    if (this.sessions.size >= this.maxSessions && this.sessions.has(userId)) {
       this.sweepExpiredSessions();
       if (this.sessions.size >= this.maxSessions) {
killedBy: WritingFeedbackSessionManager should reject the 11th session when at capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:30:11
   registerSession(userId: number, socketId: string): boolean {
     if (this.sessions.size >= this.maxSessions && !this.sessions.has(userId)) {
       this.sweepExpiredSessions();
-      if (this.sessions.size >= this.maxSessions) {
+      if (this.sessions.size < this.maxSessions) {
         return false;
       }
killedBy: WritingFeedbackSessionManager should reject the 11th session when at capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:30:51
   registerSession(userId: number, socketId: string): boolean {
     if (this.sessions.size >= this.maxSessions && !this.sessions.has(userId)) {
       this.sweepExpiredSessions();
-      if (this.sessions.size >= this.maxSessions) {
-        return false;
-      }
+      if (this.sessions.size >= this.maxSessions) {}
     }
     this.sessions.set(userId, {
killedBy: WritingFeedbackSessionManager should reject the 11th session when at capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:31:16
     if (this.sessions.size >= this.maxSessions && !this.sessions.has(userId)) {
       this.sweepExpiredSessions();
       if (this.sessions.size >= this.maxSessions) {
-        return false;
+        return true;
       }
     }
killedBy: WritingFeedbackSessionManager should reject the 11th session when at capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:38:25
       socketId,
       currentDraft: '',
       lastFeedback: null,
-      analysisInFlight: false,
+      analysisInFlight: true,
       lastActivityAt: Date.now(),
     });
killedBy: WritingFeedbackSessionManager should mark analysis in-flight and check status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:42:12
       lastActivityAt: Date.now(),
     });
     this.checkRep();
-    return true;
+    return false;
   }
 
killedBy: WritingFeedbackSessionManager should register a session and return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:45:39
     return true;
   }
 
-  removeSession(userId: number): void {
-    this.sessions.delete(userId);
-    this.checkRep();
-  }
+  removeSession(userId: number): void {}
 
   updateDraft(userId: number, draftText: string): boolean {
killedBy: WritingFeedbackSessionManager should remove a session
statusReason: Error: expect(received).toBeNull()

Received: {"analysisInFlight": false, "currentDraft": "", "lastActivityAt": 1774888624082, "lastFeedback": null, "socketId": "socket_1"}

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:52:24
 
   updateDraft(userId: number, draftText: string): boolean {
     const entry = this.sessions.get(userId);
-    if (!entry) return false;
+    if (!entry) return true;
     entry.currentDraft = draftText;
     entry.lastActivityAt = Date.now();
killedBy: WritingFeedbackSessionManager should return false when updating draft for non-existent user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:63:30
     const entry = this.sessions.get(userId);
     if (!entry) return false;
     entry.lastFeedback = structuredClone(feedback);
-    entry.analysisInFlight = false;
+    entry.analysisInFlight = true;
     entry.lastActivityAt = Date.now();
     this.checkRep();
killedBy: WritingFeedbackSessionManager should store feedback and clear analysisInFlight
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:72:30
   markAnalysisInFlight(userId: number): boolean {
     const entry = this.sessions.get(userId);
     if (!entry) return false;
-    entry.analysisInFlight = true;
+    entry.analysisInFlight = false;
     entry.lastActivityAt = Date.now();
     this.checkRep();
killedBy: WritingFeedbackSessionManager should mark analysis in-flight and check status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:80:39
 
   isAnalysisInFlight(userId: number): boolean {
     const entry = this.sessions.get(userId);
-    return entry?.analysisInFlight ?? false;
+    return entry?.analysisInFlight ?? true;
   }
 
killedBy: WritingFeedbackSessionManager should return false for isAnalysisInFlight on non-existent user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:86:9
   getSession(userId: number): SessionEntry | null {
     const entry = this.sessions.get(userId);
     if (!entry) return null;
-    if (Date.now() - entry.lastActivityAt >= this.sessionTimeoutMs) {
+    if (Date.now() - entry.lastActivityAt < this.sessionTimeoutMs) {
       this.sessions.delete(userId);
       return null;
killedBy: WritingFeedbackSessionManager should allow re-registering an existing user (reconnect)
statusReason: TypeError: Cannot read properties of null (reading 'socketId')

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:86:69
   getSession(userId: number): SessionEntry | null {
     const entry = this.sessions.get(userId);
     if (!entry) return null;
-    if (Date.now() - entry.lastActivityAt >= this.sessionTimeoutMs) {
-      this.sessions.delete(userId);
-      return null;
-    }
+    if (Date.now() - entry.lastActivityAt >= this.sessionTimeoutMs) {}
     return structuredClone(entry);
   }
killedBy: WritingFeedbackSessionManager should return null for an expired session on getSession
statusReason: Error: expect(received).toBeNull()

Received: {"analysisInFlight": false, "currentDraft": "", "lastActivityAt": 1774888650061, "lastFeedback": null, "socketId": "socket_1"}

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:96:50
   getActiveUserIds(): number[] {
     const now = Date.now();
     const active: number[] = [];
-    for (const [userId, entry] of this.sessions) {
-      if (now - entry.lastActivityAt < this.sessionTimeoutMs) {
-        active.push(userId);
-      }
-    }
+    for (const [userId, entry] of this.sessions) {}
     return active;
   }
killedBy: WritingFeedbackSessionManager should return active user IDs
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 1
Received array: []

[Killed] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:97:11
     const now = Date.now();
     const active: number[] = [];
     for (const [userId, entry] of this.sessions) {
-      if (now - entry.lastActivityAt < this.sessionTimeoutMs) {
+      if (false) {
         active.push(userId);
       }
killedBy: WritingFeedbackSessionManager should return active user IDs
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 1
Received array: []

[Killed] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:97:11
     const now = Date.now();
     const active: number[] = [];
     for (const [userId, entry] of this.sessions) {
-      if (now - entry.lastActivityAt < this.sessionTimeoutMs) {
+      if (now - entry.lastActivityAt >= this.sessionTimeoutMs) {
         active.push(userId);
       }
killedBy: WritingFeedbackSessionManager should return active user IDs
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 1
Received array: []

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:107:50
   sweepExpiredSessions(): number {
     const now = Date.now();
     let evicted = 0;
-    for (const [userId, entry] of this.sessions) {
-      if (now - entry.lastActivityAt >= this.sessionTimeoutMs) {
-        this.sessions.delete(userId);
-        evicted++;
-      }
-    }
+    for (const [userId, entry] of this.sessions) {}
     this.checkRep();
     return evicted;
killedBy: WritingFeedbackSessionManager should evict expired sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:108:64
     const now = Date.now();
     let evicted = 0;
     for (const [userId, entry] of this.sessions) {
-      if (now - entry.lastActivityAt >= this.sessionTimeoutMs) {
-        this.sessions.delete(userId);
-        evicted++;
-      }
+      if (now - entry.lastActivityAt >= this.sessionTimeoutMs) {}
     }
     this.checkRep();
killedBy: WritingFeedbackSessionManager should evict expired sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/services/WritingFeedbackSessionManager.ts:108:11
     const now = Date.now();
     let evicted = 0;
     for (const [userId, entry] of this.sessions) {
-      if (now - entry.lastActivityAt >= this.sessionTimeoutMs) {
+      if (now + entry.lastActivityAt >= this.sessionTimeoutMs) {
         this.sessions.delete(userId);
         evicted++;
killedBy: WritingFeedbackSessionManager should reject the 11th session when at capacity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UpdateOperator
src/services/WritingFeedbackSessionManager.ts:110:9
     for (const [userId, entry] of this.sessions) {
       if (now - entry.lastActivityAt >= this.sessionTimeoutMs) {
         this.sessions.delete(userId);
-        evicted++;
+        evicted--;
       }
     }
killedBy: WritingFeedbackSessionManager should evict expired sessions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:117:47
     return evicted;
   }
 
-  clearAnalysisInFlight(userId: number): void {
-    const entry = this.sessions.get(userId);
-    if (entry) {
-      entry.analysisInFlight = false;
-    }
-  }
+  clearAnalysisInFlight(userId: number): void {}
 
   private checkRep(): void {
killedBy: WritingFeedbackSessionManager should clear analysisInFlight flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/services/WritingFeedbackSessionManager.ts:119:16
 
   clearAnalysisInFlight(userId: number): void {
     const entry = this.sessions.get(userId);
-    if (entry) {
-      entry.analysisInFlight = false;
-    }
+    if (entry) {}
   }
 
killedBy: WritingFeedbackSessionManager should clear analysisInFlight flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/WritingFeedbackSessionManager.ts:120:32
   clearAnalysisInFlight(userId: number): void {
     const entry = this.sessions.get(userId);
     if (entry) {
-      entry.analysisInFlight = false;
+      entry.analysisInFlight = true;
     }
   }
killedBy: WritingFeedbackSessionManager should clear analysisInFlight flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] BlockStatement
src/services/WritingFeedbackSessionManager.ts:124:28
     }
   }
 
-  private checkRep(): void {
-    if (process.env.NODE_ENV === 'production') return;
-    console.assert(this.sessions.size <= this.maxSessions);
-    console.assert(this.maxSessions > 0);
-    console.assert(this.sessionTimeoutMs > 0);
-    for (const [userId, entry] of this.sessions) {
-      console.assert(userId > 0);
-      console.assert(entry.socketId.length > 0);
-      console.assert(entry.lastActivityAt > 0);
-      if (entry.lastFeedback !== null) {
-        console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
-        console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
-        console.assert(Array.isArray(entry.lastFeedback.issues));
-      }
-    }
-  }
+  private checkRep(): void {}
 }
 

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:126:20
 
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
-    console.assert(this.sessions.size <= this.maxSessions);
+    console.assert(this.sessions.size < this.maxSessions);
     console.assert(this.maxSessions > 0);
     console.assert(this.sessionTimeoutMs > 0);

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:126:20
 
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
-    console.assert(this.sessions.size <= this.maxSessions);
+    console.assert(false);
     console.assert(this.maxSessions > 0);
     console.assert(this.sessionTimeoutMs > 0);

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:127:20
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.sessions.size <= this.maxSessions);
-    console.assert(this.maxSessions > 0);
+    console.assert(true);
     console.assert(this.sessionTimeoutMs > 0);
     for (const [userId, entry] of this.sessions) {

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:127:20
   private checkRep(): void {
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.sessions.size <= this.maxSessions);
-    console.assert(this.maxSessions > 0);
+    console.assert(this.maxSessions >= 0);
     console.assert(this.sessionTimeoutMs > 0);
     for (const [userId, entry] of this.sessions) {

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:128:20
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.sessions.size <= this.maxSessions);
     console.assert(this.maxSessions > 0);
-    console.assert(this.sessionTimeoutMs > 0);
+    console.assert(false);
     for (const [userId, entry] of this.sessions) {
       console.assert(userId > 0);

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:128:20
     if (process.env.NODE_ENV === 'production') return;
     console.assert(this.sessions.size <= this.maxSessions);
     console.assert(this.maxSessions > 0);
-    console.assert(this.sessionTimeoutMs > 0);
+    console.assert(this.sessionTimeoutMs <= 0);
     for (const [userId, entry] of this.sessions) {
       console.assert(userId > 0);

[Survived] BlockStatement
src/services/WritingFeedbackSessionManager.ts:129:50
     console.assert(this.sessions.size <= this.maxSessions);
     console.assert(this.maxSessions > 0);
     console.assert(this.sessionTimeoutMs > 0);
-    for (const [userId, entry] of this.sessions) {
-      console.assert(userId > 0);
-      console.assert(entry.socketId.length > 0);
-      console.assert(entry.lastActivityAt > 0);
-      if (entry.lastFeedback !== null) {
-        console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
-        console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
-        console.assert(Array.isArray(entry.lastFeedback.issues));
-      }
-    }
+    for (const [userId, entry] of this.sessions) {}
   }
 }

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:130:22
     console.assert(this.maxSessions > 0);
     console.assert(this.sessionTimeoutMs > 0);
     for (const [userId, entry] of this.sessions) {
-      console.assert(userId > 0);
+      console.assert(userId <= 0);
       console.assert(entry.socketId.length > 0);
       console.assert(entry.lastActivityAt > 0);

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:130:22
     console.assert(this.maxSessions > 0);
     console.assert(this.sessionTimeoutMs > 0);
     for (const [userId, entry] of this.sessions) {
-      console.assert(userId > 0);
+      console.assert(false);
       console.assert(entry.socketId.length > 0);
       console.assert(entry.lastActivityAt > 0);

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:131:22
     console.assert(this.sessionTimeoutMs > 0);
     for (const [userId, entry] of this.sessions) {
       console.assert(userId > 0);
-      console.assert(entry.socketId.length > 0);
+      console.assert(entry.socketId.length >= 0);
       console.assert(entry.lastActivityAt > 0);
       if (entry.lastFeedback !== null) {

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:131:22
     console.assert(this.sessionTimeoutMs > 0);
     for (const [userId, entry] of this.sessions) {
       console.assert(userId > 0);
-      console.assert(entry.socketId.length > 0);
+      console.assert(true);
       console.assert(entry.lastActivityAt > 0);
       if (entry.lastFeedback !== null) {

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:132:22
     for (const [userId, entry] of this.sessions) {
       console.assert(userId > 0);
       console.assert(entry.socketId.length > 0);
-      console.assert(entry.lastActivityAt > 0);
+      console.assert(entry.lastActivityAt <= 0);
       if (entry.lastFeedback !== null) {
         console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:132:22
     for (const [userId, entry] of this.sessions) {
       console.assert(userId > 0);
       console.assert(entry.socketId.length > 0);
-      console.assert(entry.lastActivityAt > 0);
+      console.assert(true);
       if (entry.lastFeedback !== null) {
         console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);

[Survived] BlockStatement
src/services/WritingFeedbackSessionManager.ts:133:40
       console.assert(userId > 0);
       console.assert(entry.socketId.length > 0);
       console.assert(entry.lastActivityAt > 0);
-      if (entry.lastFeedback !== null) {
-        console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
-        console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
-        console.assert(Array.isArray(entry.lastFeedback.issues));
-      }
+      if (entry.lastFeedback !== null) {}
     }
   }

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:134:57
       console.assert(entry.socketId.length > 0);
       console.assert(entry.lastActivityAt > 0);
       if (entry.lastFeedback !== null) {
-        console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
+        console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score > 1);
         console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
         console.assert(Array.isArray(entry.lastFeedback.issues));

[Survived] ConditionalExpression
src/services/WritingFeedbackSessionManager.ts:134:24
       console.assert(entry.socketId.length > 0);
       console.assert(entry.lastActivityAt > 0);
       if (entry.lastFeedback !== null) {
-        console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
+        console.assert(false);
         console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
         console.assert(Array.isArray(entry.lastFeedback.issues));

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:135:24
       console.assert(entry.lastActivityAt > 0);
       if (entry.lastFeedback !== null) {
         console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
-        console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
+        console.assert(entry.lastFeedback.confidence < 0 && entry.lastFeedback.confidence <= 1);
         console.assert(Array.isArray(entry.lastFeedback.issues));
       }

[Survived] EqualityOperator
src/services/WritingFeedbackSessionManager.ts:135:24
       console.assert(entry.lastActivityAt > 0);
       if (entry.lastFeedback !== null) {
         console.assert(entry.lastFeedback.score >= 0 && entry.lastFeedback.score <= 1);
-        console.assert(entry.lastFeedback.confidence >= 0 && entry.lastFeedback.confidence <= 1);
+        console.assert(entry.lastFeedback.confidence > 0 && entry.lastFeedback.confidence <= 1);
         console.assert(Array.isArray(entry.lastFeedback.issues));
       }
