[Survived] EqualityOperator
src/services/WritingFeedbackService.ts:80:19
       score,
       suggestions,
       goodPoints,
-      confidence: issues.length > 0
+      confidence: issues.length <= 0
         ? issues.reduce((sum, i) => sum + i.confidence, 0) / issues.length
         : 0.5,

[Survived] ConditionalExpression
src/services/WritingFeedbackService.ts:80:19
       score,
       suggestions,
       goodPoints,
-      confidence: issues.length > 0
+      confidence: true
         ? issues.reduce((sum, i) => sum + i.confidence, 0) / issues.length
         : 0.5,

[Survived] ArithmeticOperator
src/services/WritingFeedbackService.ts:81:11
       suggestions,
       goodPoints,
       confidence: issues.length > 0
-        ? issues.reduce((sum, i) => sum + i.confidence, 0) / issues.length
+        ? issues.reduce((sum, i) => sum + i.confidence, 0) * issues.length
         : 0.5,
       generatedAt: new Date(),

[Survived] ArithmeticOperator
src/services/WritingFeedbackService.ts:81:37
       suggestions,
       goodPoints,
       confidence: issues.length > 0
-        ? issues.reduce((sum, i) => sum + i.confidence, 0) / issues.length
+        ? issues.reduce((sum, i) => sum - i.confidence, 0) / issues.length
         : 0.5,
       generatedAt: new Date(),

[Killed] EqualityOperator
src/services/WritingFeedbackService.ts:88:9
   }
 
   private computeScore(issues: Issue[]): number {
-    if (issues.length === 0) return 1.0;
+    if (issues.length !== 0) return 1.0;
     const severityWeights: Record<string, number> = { high: 0.15, medium: 0.1, low: 0.05 };
     let penalty = 0;
killedBy: WritingFeedbackService should reduce score proportionally to issue severity
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[Killed] ConditionalExpression
src/services/WritingFeedbackService.ts:88:9
   }
 
   private computeScore(issues: Issue[]): number {
-    if (issues.length === 0) return 1.0;
+    if (true) return 1.0;
     const severityWeights: Record<string, number> = { high: 0.15, medium: 0.1, low: 0.05 };
     let penalty = 0;
killedBy: WritingFeedbackService should reduce score proportionally to issue severity
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[Survived] ObjectLiteral
src/services/WritingFeedbackService.ts:89:53
 
   private computeScore(issues: Issue[]): number {
     if (issues.length === 0) return 1.0;
-    const severityWeights: Record<string, number> = { high: 0.15, medium: 0.1, low: 0.05 };
+    const severityWeights: Record<string, number> = {};
     let penalty = 0;
     for (const issue of issues) {

[Killed] BlockStatement
src/services/WritingFeedbackService.ts:91:33
     if (issues.length === 0) return 1.0;
     const severityWeights: Record<string, number> = { high: 0.15, medium: 0.1, low: 0.05 };
     let penalty = 0;
-    for (const issue of issues) {
-      penalty += severityWeights[issue.severity] || 0.05;
-    }
+    for (const issue of issues) {}
     return Math.max(0, Math.min(1, parseFloat((1 - penalty).toFixed(2))));
   }
killedBy: WritingFeedbackService should reduce score proportionally to issue severity
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[Killed] AssignmentOperator
src/services/WritingFeedbackService.ts:92:7
     const severityWeights: Record<string, number> = { high: 0.15, medium: 0.1, low: 0.05 };
     let penalty = 0;
     for (const issue of issues) {
-      penalty += severityWeights[issue.severity] || 0.05;
+      penalty -= severityWeights[issue.severity] || 0.05;
     }
     return Math.max(0, Math.min(1, parseFloat((1 - penalty).toFixed(2))));
killedBy: WritingFeedbackService should reduce score proportionally to issue severity
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[Survived] LogicalOperator
src/services/WritingFeedbackService.ts:92:18
     const severityWeights: Record<string, number> = { high: 0.15, medium: 0.1, low: 0.05 };
     let penalty = 0;
     for (const issue of issues) {
-      penalty += severityWeights[issue.severity] || 0.05;
+      penalty += severityWeights[issue.severity] && 0.05;
     }
     return Math.max(0, Math.min(1, parseFloat((1 - penalty).toFixed(2))));

[Killed] MethodExpression
src/services/WritingFeedbackService.ts:94:24
     for (const issue of issues) {
       penalty += severityWeights[issue.severity] || 0.05;
     }
-    return Math.max(0, Math.min(1, parseFloat((1 - penalty).toFixed(2))));
+    return Math.max(0, Math.max(1, parseFloat((1 - penalty).toFixed(2))));
   }
 
killedBy: WritingFeedbackService should reduce score proportionally to issue severity
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[Killed] ArithmeticOperator
src/services/WritingFeedbackService.ts:94:48
     for (const issue of issues) {
       penalty += severityWeights[issue.severity] || 0.05;
     }
-    return Math.max(0, Math.min(1, parseFloat((1 - penalty).toFixed(2))));
+    return Math.max(0, Math.min(1, parseFloat((1 + penalty).toFixed(2))));
   }
 
killedBy: WritingFeedbackService should reduce score proportionally to issue severity
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   1

[NoCoverage] ConditionalExpression
src/services/WritingFeedbackService.ts:102:9
 
     for (const issue of issues) {
       switch (issue.type) {
-        case 'circular_logic':
-          suggestions.push({
-            text: 'Remove the repeated argument or expand it with new evidence',
-            type: 'structure',
-            priority: 'medium',
-            exampleFix: 'Move this to a separate paragraph with new supporting points',
-          });
-          break;
+        case 'circular_logic':
         case 'weak_evidence':
           suggestions.push({

[Survived] ConditionalExpression
src/services/WritingFeedbackService.ts:110:9
             exampleFix: 'Move this to a separate paragraph with new supporting points',
           });
           break;
-        case 'weak_evidence':
-          suggestions.push({
-            text: 'Add a specific citation (e.g., study name, survey data, or URL)',
-            type: 'reference',
-            priority: 'high',
-            exampleFix: "'According to the [specific study/survey]...'",
-          });
-          break;
+        case 'weak_evidence':
         case 'unsupported_claim':
           suggestions.push({

[Survived] StringLiteral
src/services/WritingFeedbackService.ts:112:19
           break;
         case 'weak_evidence':
           suggestions.push({
-            text: 'Add a specific citation (e.g., study name, survey data, or URL)',
+            text: "",
             type: 'reference',
             priority: 'high',

[Survived] ConditionalExpression
src/services/WritingFeedbackService.ts:118:9
             exampleFix: "'According to the [specific study/survey]...'",
           });
           break;
-        case 'unsupported_claim':
-          suggestions.push({
-            text: 'Avoid absolute claims — qualify your statement with evidence',
-            type: 'clarity',
-            priority: 'high',
-            exampleFix: "'Many/Most [subject] prefer...' instead of 'All [subject] prefer...'",
-          });
-          break;
+        case 'unsupported_claim':
       }
     }

[Survived] StringLiteral
src/services/WritingFeedbackService.ts:120:19
           break;
         case 'unsupported_claim':
           suggestions.push({
-            text: 'Avoid absolute claims — qualify your statement with evidence',
+            text: "",
             type: 'clarity',
             priority: 'high',

[Killed] BlockStatement
src/services/WritingFeedbackService.ts:136:57
     const goodPoints: string[] = [];
 
     // Check for clear position statement
-    if (/I (think|believe|argue|contend)\b/.test(text)) {
-      goodPoints.push('Clear assertion of main position');
-    }
+    if (/I (think|believe|argue|contend)\b/.test(text)) {}
 
     // Check for any evidence attempt
killedBy: WritingFeedbackService should identify a clear position statement
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Clear assertion of main position"
Received array: ["Mentions specific technical concepts"]

[Killed] ConditionalExpression
src/services/WritingFeedbackService.ts:136:9
     const goodPoints: string[] = [];
 
     // Check for clear position statement
-    if (/I (think|believe|argue|contend)\b/.test(text)) {
+    if (false) {
       goodPoints.push('Clear assertion of main position');
     }
killedBy: WritingFeedbackService should identify a clear position statement
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Clear assertion of main position"
Received array: ["Mentions specific technical concepts"]

[Killed] ConditionalExpression
src/services/WritingFeedbackService.ts:141:9
     }
 
     // Check for any evidence attempt
-    if (/according to|study|data|research|survey|report|percent|%|\d{4}/.test(text)) {
+    if (false) {
       goodPoints.push('Attempts to provide evidence');
     }
killedBy: WritingFeedbackService should identify evidence attempts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Attempts to provide evidence"
Received array: ["Mentions specific technical concepts"]

[Killed] BlockStatement
src/services/WritingFeedbackService.ts:141:86
     }
 
     // Check for any evidence attempt
-    if (/according to|study|data|research|survey|report|percent|%|\d{4}/.test(text)) {
-      goodPoints.push('Attempts to provide evidence');
-    }
+    if (/according to|study|data|research|survey|report|percent|%|\d{4}/.test(text)) {}
 
     // Check for specific technical terms
killedBy: WritingFeedbackService should identify evidence attempts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Attempts to provide evidence"
Received array: ["Mentions specific technical concepts"]

[Survived] ConditionalExpression
src/services/WritingFeedbackService.ts:146:9
     }
 
     // Check for specific technical terms
-    if (/\b[A-Z][a-zA-Z]+(?:\s[A-Z][a-zA-Z]+)*\b/.test(text)) {
+    if (true) {
       goodPoints.push('Mentions specific technical concepts');
     }

[Survived] ConditionalExpression
src/services/WritingFeedbackService.ts:146:9
     }
 
     // Check for specific technical terms
-    if (/\b[A-Z][a-zA-Z]+(?:\s[A-Z][a-zA-Z]+)*\b/.test(text)) {
+    if (false) {
       goodPoints.push('Mentions specific technical concepts');
     }

[Survived] StringLiteral
src/services/WritingFeedbackService.ts:147:23
 
     // Check for specific technical terms
     if (/\b[A-Z][a-zA-Z]+(?:\s[A-Z][a-zA-Z]+)*\b/.test(text)) {
-      goodPoints.push('Mentions specific technical concepts');
+      goodPoints.push("");
     }
 

[Survived] ConditionalExpression
src/services/WritingFeedbackService.ts:150:9
       goodPoints.push('Mentions specific technical concepts');
     }
 
-    if (goodPoints.length === 0) {
+    if (false) {
       goodPoints.push('Draft submitted for analysis');
     }

[Survived] BlockStatement
src/services/WritingFeedbackService.ts:150:34
       goodPoints.push('Mentions specific technical concepts');
     }
 
-    if (goodPoints.length === 0) {
-      goodPoints.push('Draft submitted for analysis');
-    }
+    if (goodPoints.length === 0) {}
 
     return goodPoints;

[Survived] StringLiteral
src/services/WritingFeedbackService.ts:151:23
     }
 
     if (goodPoints.length === 0) {
-      goodPoints.push('Draft submitted for analysis');
+      goodPoints.push("");
     }
 
